       program-id. TotalCotisation as "StatistiqueSinistresAssures.TotalCotisation".

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program TotalCotisation.